app/workers/chat_worker.rb

INSERT INTO `chats` (`number`, `created_at`, `updated_at`, `app_id`, `application_token`) VALUES (2, '2022-11-23 09:29:55', '2022-11-23 09:29:55', 1, 'RgZmCTLkPZzzkmPd5nwGSc6Q')
---
  def perform(application_id, application_token, chat_number)
    ActiveRecord::Base.connection_pool.with_connection do
      Chat.create!(
        number: chat_number,
        app_id: application_id,
        application_token: application_token,
      )