app/workers/message_worker.rb

INSERT INTO `messages` (`content`, `number`, `created_at`, `updated_at`, `chat_id`, `application_token`, `chat_number`) VALUES ('{\n    \"content\": \"HELLO WORLD MSG\"\n}', 10, '2022-11-23 11:43:44.309029', '2022-11-23 11:43:44.309029', 3, 'RgZmCTLkPZzzkmPd5nwGSc6Q', 2)
---
    def perform(application_token, chat_id, chat_number, message_number, body)
      ActiveRecord::Base.connection_pool.with_connection do
        Message.create!(
          number: message_number,
          chat_id: chat_id,
          chat_number: chat_number,
          application_token: application_token,
          content: body,
        )