app/controllers/app_controller.rb

SELECT `apps`.* FROM `apps`
---
    def index
        @apps = App.all

UPDATE `apps` SET `apps`.`name` = 'NEW APP NAME', `apps`.`updated_at` = '2022-11-23 22:39:09.092102' WHERE `apps`.`id` = 1
---
    def update
        if @app.present?
            if @app.update(app_params)

INSERT INTO `apps` (`token`, `name`, `created_at`, `updated_at`, `chats_count`) VALUES ('zbaeucnv22rFisffccTLWqjd', 'application 1', '2022-11-22 08:55:40.829122', '2022-11-22 08:55:40.829122', 0)
---
    def post
        @app = App.new(name: params[:name])
        begin
            @app.save

SELECT `apps`.* FROM `apps` WHERE `apps`.`token` = 'qKnaS6AFNuW6zzZSgzzAKddp' LIMIT 1
---
    def set_app
        @app = App.find_by(token: params[:token])