app/controllers/chat_controller.rb

    def set_chat
        @chat = Chat.find_by(number: params[:chat_number], application_token: params[:application_token])
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = 'RgZmCTLkPZzzkmPd5nwGSc6Q' LIMIT 1

    def set_app
        @app = App.find_by(token: params[:application_token])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`token` = 'EHmJBfWNXWRa6GNZJt4zv1Sw' LIMIT 1