app/controllers/message_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`number` IS NULL LIMIT 1
---
    def get
        if @chat.present?
                if params[:body].nil?
                    @messages = []
                  else
                    @messages = Message.search(params[:body], @chat.number, @chat.application_token)

UPDATE `messages` SET `messages`.`content` = 'NEW CONTENT', `messages`.`updated_at` = '2022-11-23 22:20:05.055265' WHERE `messages`.`id` = 1
---
    def update
        if @message.present?
            if @message.update(message_params)

SELECT `chats`.* FROM `chats` WHERE `chats`.`number` = 1 AND `chats`.`application_token` = '1XBnxf65Jse8tDJr8bwQvRAz' LIMIT 1
---
    def set_chat
        @chat = Chat.find_by(number: params[:chat_number], application_token: params[:application_token])

SELECT `messages`.* FROM `messages` WHERE `messages`.`number` IS NULL AND `messages`.`chat_number` = 1 AND `messages`.`application_token` = 'qKnaS6AFNuW6zzZSgzzAKddp' LIMIT 1
---
    def set_message
        @message = Message.find_by(number: params[:number],chat_number: params[:chat_number], application_token: params[:application_token])